# FabricAreaType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricArea..::..FabricAreaType Property
FabricArea Class See Also
---
The type of the Fabric Area.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public FabricAreaType FabricAreaType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FabricAreaType As FabricAreaType
	Get
```

Visual C++
---
```text
public:
property FabricAreaType^ FabricAreaType {
	FabricAreaType^ get ();
}
```

# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace